#### BuiltInFailures.LegendFailures Members

---

|  |
| --- |
| BuiltInFailures LegendFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures LegendFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | LegendComponentBadViewType | Legend Components may only be placed in Legends |
| Public property Static member | LegendComponentNotVisible | The component you have selected is not visible in the selected view. |

# See Also

BuiltInFailures LegendFailures Class

Autodesk.Revit.DB Namespace